run/flow_wave/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
(0 -400 0) 
(1000 -400 0) 
(1000 100 0) 
(0 100 0) 
(0 -400 10) 
(1000 -400 10) 
(1000 100 10) 
(0 100 10) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (500 250 5) simpleGrading (1 1 1) 
);



edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    axis
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    side
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    front
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    back
    {
        type patch;
        faces
        (
            (1 0 3 2)
        );
    }

);

// ************************************************************************* //
