run/flow_wave/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type basicMultiphaseSystem;

phases (particles air);

pMin 10000;

particles
{
    type          purePhaseModel;
    diameterModel constant;
    constantCoeffs
    {
        d               1e-5;
    }

    alphaMax        0.62;
    residualAlpha   1e-6;
}

air
{
    type          purePhaseModel;
    diameterModel constant;
    constantCoeffs
    {
        d               1;
    }

    residualAlpha   0;
}

blending
{
    default
    {
        type            continuous;
        phase air;
    }
}

surfaceTension
(
    (particles and air)
    {
        type            constant;
        sigma           0;
    }
);

aspectRatio
();

drag
(
 (particles in air)
 {
   type timeScaleFiltered;
   minRelaxTime 1e-5;
   
        dragModel 
	  {
            type            GidaspowErgunWenYu;
            residualRe      1e-3;
            swarmCorrection
	      {
                type        none;
	      }
	  }
 }
 );

virtualMass
(
    (particles in air)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer
(
    (particles in air)
    {
        type            RanzMarshall;
        residualAlpha   1e-3;
    }
);

phaseTransfer
();

lift
();

wallLubrication
();

turbulentDispersion
();

interfaceCompression
();

// ************************************************************************* //
