run/flow_wave/0/T.air.init
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  10.0                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 293;
        value           uniform 293;
    }
    outOrIn
    {
        type            inletOutlet;
        phi             phi.air;
        inletValue      uniform 293;
        value           uniform 293;
    }
    frontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
