run/flow_wave/0/rho.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [1 -3 0 0 0 0 0];

internalField       uniform 0.0;

boundaryField
{
    wall
    {
        type               calculated;
        value              $internalField;   
    }
    inlet
    {
        type               calculated;
        value              $internalField;   
    }
    side
    {
        type               calculated;
        value              $internalField;   
    }
    axis
    {
        type               calculated;
        value              $internalField;   
    }
    top
    {
        type               calculated;
        value              $internalField;   
    }

    frontAndBack
    {
        type            empty;
    }

}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
